Ran Apply for 6 projects:

1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
---

### 1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_network...

07:41:09.293 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:41:09.397 INFO   Downloading Terraform configurations from ../../../../../../../modules/vpc into ./.terragrunt-cache/5w6gibcvaj3fxjSYf-zhrHjyPKU/3yRb6rw95CdoOVkeZaGeagf6NeY
07:41:09.456 INFO   terraform1.13.3: Initializing the backend...
07:41:10.384 INFO   terraform1.13.3: 
07:41:10.384 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:41:10.384 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:41:10.660 INFO   terraform1.13.3: Initializing provider plugins...
07:41:10.660 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:41:10.923 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:41:11.325 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:41:11.326 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:41:11.326 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:41:11.326 INFO   terraform1.13.3: you run "terraform init" in the future.
07:41:11.326 INFO   terraform1.13.3: ╷
07:41:11.327 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:41:11.327 INFO   terraform1.13.3: │ 
07:41:11.327 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:41:11.327 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:41:11.327 INFO   terraform1.13.3: │   - hashicorp/google
07:41:11.327 INFO   terraform1.13.3: │ 
07:41:11.328 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:41:11.328 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:41:11.328 INFO   terraform1.13.3: │ these providers.
07:41:11.329 INFO   terraform1.13.3: │ 
07:41:11.329 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:41:11.329 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:41:11.329 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:41:11.329 INFO   terraform1.13.3: ╵
07:41:11.330 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:41:14.481 STDOUT terraform1.13.3: google_compute_network.vpc_network: Refreshing state... [id=projects/iac-01/global/networks/stg-iac-01]
07:41:15.474 STDOUT terraform1.13.3: google_compute_subnetwork.subnets["ause2"]: Refreshing state... [id=projects/iac-01/regions/australia-southeast2/subnetworks/ause2]
07:41:15.475 STDOUT terraform1.13.3: google_compute_subnetwork.subnets["ause1"]: Refreshing state... [id=projects/iac-01/regions/australia-southeast1/subnetworks/ause1]
07:41:15.869 STDOUT terraform1.13.3: No changes. Your infrastructure matches the configuration.
07:41:15.869 STDOUT terraform1.13.3: Terraform has compared your real infrastructure against your configuration
07:41:15.869 STDOUT terraform1.13.3: and found no differences, so no changes are needed.
07:41:16.923 STDOUT terraform1.13.3: 
07:41:16.923 STDOUT terraform1.13.3: Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
07:41:16.923 STDOUT terraform1.13.3: 
07:41:16.923 STDOUT terraform1.13.3: Outputs:
07:41:16.923 STDOUT terraform1.13.3: 
07:41:16.924 STDOUT terraform1.13.3: network_id = "projects/iac-01/global/networks/stg-iac-01"
07:41:16.924 STDOUT terraform1.13.3: network_self_link = "https://www.googleapis.com/compute/v1/projects/iac-01/global/networks/stg-iac-01"
07:41:16.924 STDOUT terraform1.13.3: subnets = {
07:41:16.924 STDOUT terraform1.13.3:   "ause1" = "https://www.googleapis.com/compute/v1/projects/iac-01/regions/australia-southeast1/subnetworks/ause1"
07:41:16.925 STDOUT terraform1.13.3:   "ause2" = "https://www.googleapis.com/compute/v1/projects/iac-01/regions/australia-southeast2/subnetworks/ause2"
07:41:16.925 STDOUT terraform1.13.3: }
```

</details>

---
### 2. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com...

07:41:09.302 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:41:09.448 INFO   Downloading Terraform configurations from ../../../../../../../../modules/dns-zone into ./.terragrunt-cache/YPxPpTHI825G6orVr7Q9v8RK4BM/_dMaxM82QOeXIH12CDigfcDxL8U
07:41:09.500 INFO   terraform1.13.3: Initializing the backend...
07:41:10.383 INFO   terraform1.13.3: 
07:41:10.383 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:41:10.383 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:41:10.662 INFO   terraform1.13.3: Initializing provider plugins...
07:41:10.662 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:41:10.922 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:41:11.327 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:41:11.328 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:41:11.328 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:41:11.328 INFO   terraform1.13.3: you run "terraform init" in the future.
07:41:11.330 INFO   terraform1.13.3: ╷
07:41:11.331 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:41:11.331 INFO   terraform1.13.3: │ 
07:41:11.331 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:41:11.332 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:41:11.332 INFO   terraform1.13.3: │   - hashicorp/google
07:41:11.332 INFO   terraform1.13.3: │ 
07:41:11.332 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:41:11.333 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:41:11.333 INFO   terraform1.13.3: │ these providers.
07:41:11.333 INFO   terraform1.13.3: │ 
07:41:11.333 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:41:11.333 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:41:11.333 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:41:11.333 INFO   terraform1.13.3: ╵
07:41:11.333 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:41:14.528 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:41:14.531 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:41:14.531 STDOUT terraform1.13.3:   + create
07:41:14.531 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:41:14.531 STDOUT terraform1.13.3:   # google_dns_managed_zone.zone will be created
07:41:14.531 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "zone" {
07:41:14.531 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
07:41:14.531 STDOUT terraform1.13.3:       + description      = "Public DNS zone for stg"
07:41:14.532 STDOUT terraform1.13.3:       + dns_name         = "iac.com."
07:41:14.532 STDOUT terraform1.13.3:       + effective_labels = {
07:41:14.532 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:41:14.532 STDOUT terraform1.13.3:         }
07:41:14.532 STDOUT terraform1.13.3:       + force_destroy    = false
07:41:14.532 STDOUT terraform1.13.3:       + id               = (known after apply)
07:41:14.532 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
07:41:14.532 STDOUT terraform1.13.3:       + name             = "iac-com"
07:41:14.532 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
07:41:14.532 STDOUT terraform1.13.3:       + project          = "iac-01"
07:41:14.533 STDOUT terraform1.13.3:       + terraform_labels = {
07:41:14.533 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:41:14.533 STDOUT terraform1.13.3:         }
07:41:14.533 STDOUT terraform1.13.3:       + visibility       = "public"
07:41:14.533 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
07:41:14.533 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
07:41:14.533 STDOUT terraform1.13.3:     }
07:41:14.534 STDOUT terraform1.13.3: Plan: 1 to add, 0 to change, 0 to destroy.
07:41:14.534 STDOUT terraform1.13.3: 
07:41:14.534 STDOUT terraform1.13.3: Changes to Outputs:
07:41:14.534 STDOUT terraform1.13.3:   + dns_name     = "iac.com."
07:41:14.534 STDOUT terraform1.13.3:   + name_servers = (known after apply)
07:41:14.534 STDOUT terraform1.13.3:   + zone_name    = "iac-com"
07:41:15.474 STDOUT terraform1.13.3: google_dns_managed_zone.zone: Creating...
07:41:17.070 STDOUT terraform1.13.3: google_dns_managed_zone.zone: Creation complete after 2s [id=projects/iac-01/managedZones/iac-com]
07:41:17.260 STDOUT terraform1.13.3: 
07:41:17.260 STDOUT terraform1.13.3: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
07:41:17.260 STDOUT terraform1.13.3: 
07:41:17.260 STDOUT terraform1.13.3: Outputs:
07:41:17.260 STDOUT terraform1.13.3: dns_name = "iac.com."
07:41:17.260 STDOUT terraform1.13.3: name_servers = tolist([
07:41:17.260 STDOUT terraform1.13.3:   "ns-cloud-d1.googledomains.com.",
07:41:17.260 STDOUT terraform1.13.3:   "ns-cloud-d2.googledomains.com.",
07:41:17.260 STDOUT terraform1.13.3:   "ns-cloud-d3.googledomains.com.",
07:41:17.261 STDOUT terraform1.13.3:   "ns-cloud-d4.googledomains.com.",
07:41:17.261 STDOUT terraform1.13.3: ])
07:41:17.261 STDOUT terraform1.13.3: zone_name = "iac-com"
```

</details>

---
### 3. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc...

07:41:09.300 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:41:09.401 INFO   Downloading Terraform configurations from ../../../../../../../../modules/service-connection-policy into ./.terragrunt-cache/JHnwArN4uhtnxvY0b8AGmJWgmPE/ghQYBiw_46nvReGWXzo3R28a18g
07:41:09.460 INFO   terraform1.13.3: Initializing the backend...
07:41:10.383 INFO   terraform1.13.3: 
07:41:10.384 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:41:10.384 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:41:10.665 INFO   terraform1.13.3: Initializing provider plugins...
07:41:10.665 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:41:10.926 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:41:11.324 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:41:11.324 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:41:11.324 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:41:11.325 INFO   terraform1.13.3: you run "terraform init" in the future.
07:41:11.325 INFO   terraform1.13.3: ╷
07:41:11.325 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:41:11.325 INFO   terraform1.13.3: │ 
07:41:11.325 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:41:11.325 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:41:11.326 INFO   terraform1.13.3: │   - hashicorp/google
07:41:11.326 INFO   terraform1.13.3: │ 
07:41:11.326 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:41:11.330 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:41:11.330 INFO   terraform1.13.3: │ these providers.
07:41:11.331 INFO   terraform1.13.3: │ 
07:41:11.331 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:41:11.331 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:41:11.332 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:41:11.332 INFO   terraform1.13.3: ╵
07:41:11.332 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:41:14.552 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:41:14.552 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:41:14.553 STDOUT terraform1.13.3:   + create
07:41:14.553 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:41:14.553 STDOUT terraform1.13.3:   # google_network_connectivity_service_connection_policy.policy["valkey-psc"] will be created
07:41:14.553 STDOUT terraform1.13.3:   + resource "google_network_connectivity_service_connection_policy" "policy" {
07:41:14.553 STDOUT terraform1.13.3:       + create_time      = (known after apply)
07:41:14.553 STDOUT terraform1.13.3:       + effective_labels = {
07:41:14.553 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:41:14.554 STDOUT terraform1.13.3:         }
07:41:14.554 STDOUT terraform1.13.3:       + etag             = (known after apply)
07:41:14.554 STDOUT terraform1.13.3:       + id               = (known after apply)
07:41:14.554 STDOUT terraform1.13.3:       + infrastructure   = (known after apply)
07:41:14.554 STDOUT terraform1.13.3:       + location         = "australia-southeast2"
07:41:14.554 STDOUT terraform1.13.3:       + name             = "valkey-psc"
07:41:14.554 STDOUT terraform1.13.3:       + network          = "projects/iac-01/global/networks/stg-iac-01"
07:41:14.555 STDOUT terraform1.13.3:       + project          = "iac-01"
07:41:14.555 STDOUT terraform1.13.3:       + psc_connections  = (known after apply)
07:41:14.555 STDOUT terraform1.13.3:       + service_class    = "gcp-memorystore"
07:41:14.555 STDOUT terraform1.13.3:       + terraform_labels = {
07:41:14.555 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:41:14.555 STDOUT terraform1.13.3:         }
07:41:14.555 STDOUT terraform1.13.3:       + update_time      = (known after apply)
07:41:14.555 STDOUT terraform1.13.3:       + psc_config {
07:41:14.555 STDOUT terraform1.13.3:           + producer_instance_location = (known after apply)
07:41:14.555 STDOUT terraform1.13.3:           + subnetworks                = [
07:41:14.555 STDOUT terraform1.13.3:               + "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
07:41:14.556 STDOUT terraform1.13.3:             ]
07:41:14.556 STDOUT terraform1.13.3:         }
07:41:14.556 STDOUT terraform1.13.3:     }
07:41:14.556 STDOUT terraform1.13.3:   # google_project_service.networkconnectivity will be created
07:41:14.556 STDOUT terraform1.13.3:   + resource "google_project_service" "networkconnectivity" {
07:41:14.556 STDOUT terraform1.13.3:       + disable_on_destroy = false
07:41:14.556 STDOUT terraform1.13.3:       + id                 = (known after apply)
07:41:14.556 STDOUT terraform1.13.3:       + project            = "iac-01"
07:41:14.556 STDOUT terraform1.13.3:       + service            = "networkconnectivity.googleapis.com"
07:41:14.557 STDOUT terraform1.13.3:     }
07:41:14.557 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
07:41:14.557 STDOUT terraform1.13.3: 
07:41:14.557 STDOUT terraform1.13.3: Changes to Outputs:
07:41:14.557 STDOUT terraform1.13.3:   + policies   = {
07:41:14.557 STDOUT terraform1.13.3:       + valkey-psc = {
07:41:14.557 STDOUT terraform1.13.3:           + create_time      = (known after apply)
07:41:14.557 STDOUT terraform1.13.3:           + description      = null
07:41:14.557 STDOUT terraform1.13.3:           + effective_labels = {
07:41:14.557 STDOUT terraform1.13.3:               + goog-terraform-provisioned = "true"
07:41:14.558 STDOUT terraform1.13.3:             }
07:41:14.558 STDOUT terraform1.13.3:           + etag             = (known after apply)
07:41:14.558 STDOUT terraform1.13.3:           + id               = (known after apply)
07:41:14.558 STDOUT terraform1.13.3:           + infrastructure   = (known after apply)
07:41:14.558 STDOUT terraform1.13.3:           + labels           = null
07:41:14.558 STDOUT terraform1.13.3:           + location         = "australia-southeast2"
07:41:14.559 STDOUT terraform1.13.3:           + name             = "valkey-psc"
07:41:14.559 STDOUT terraform1.13.3:           + network          = "projects/iac-01/global/networks/stg-iac-01"
07:41:14.559 STDOUT terraform1.13.3:           + project          = "iac-01"
07:41:14.559 STDOUT terraform1.13.3:           + psc_config       = [
07:41:14.559 STDOUT terraform1.13.3:               + {
07:41:14.559 STDOUT terraform1.13.3:                   + allowed_google_producers_resource_hierarchy_level = null
07:41:14.560 STDOUT terraform1.13.3:                   + limit                                             = null
07:41:14.560 STDOUT terraform1.13.3:                   + producer_instance_location                        = (known after apply)
07:41:14.560 STDOUT terraform1.13.3:                   + subnetworks                                       = [
07:41:14.560 STDOUT terraform1.13.3:                       + "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
07:41:14.560 STDOUT terraform1.13.3:                     ]
07:41:14.560 STDOUT terraform1.13.3:                 },
07:41:14.560 STDOUT terraform1.13.3:             ]
07:41:14.560 STDOUT terraform1.13.3:           + psc_connections  = (known after apply)
07:41:14.560 STDOUT terraform1.13.3:           + service_class    = "gcp-memorystore"
07:41:14.561 STDOUT terraform1.13.3:           + terraform_labels = {
07:41:14.561 STDOUT terraform1.13.3:               + goog-terraform-provisioned = "true"
07:41:14.561 STDOUT terraform1.13.3:             }
07:41:14.561 STDOUT terraform1.13.3:           + timeouts         = null
07:41:14.561 STDOUT terraform1.13.3:           + update_time      = (known after apply)
07:41:14.561 STDOUT terraform1.13.3:         }
07:41:14.561 STDOUT terraform1.13.3:     }
07:41:14.561 STDOUT terraform1.13.3:   + policy_ids = {
07:41:14.561 STDOUT terraform1.13.3:       + valkey-psc = (known after apply)
07:41:14.561 STDOUT terraform1.13.3:     }
07:41:15.472 STDOUT terraform1.13.3: google_project_service.networkconnectivity: Creating...
07:41:19.363 STDOUT terraform1.13.3: google_project_service.networkconnectivity: Creation complete after 4s [id=iac-01/networkconnectivity.googleapis.com]
07:41:19.371 STDOUT terraform1.13.3: google_network_connectivity_service_connection_policy.policy["valkey-psc"]: Creating...
07:41:29.379 STDOUT terraform1.13.3: google_network_connectivity_service_connection_policy.policy["valkey-psc"]: Still creating... [00m10s elapsed]
07:41:33.276 STDOUT terraform1.13.3: google_network_connectivity_service_connection_policy.policy["valkey-psc"]: Creation complete after 14s [id=projects/iac-01/locations/australia-southeast2/serviceConnectionPolicies/valkey-psc]
07:41:33.544 STDOUT terraform1.13.3: 
07:41:33.544 STDOUT terraform1.13.3: Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
07:41:33.545 STDOUT terraform1.13.3: 
07:41:33.545 STDOUT terraform1.13.3: Outputs:
07:41:33.545 STDOUT terraform1.13.3: policies = {
07:41:33.545 STDOUT terraform1.13.3:   "valkey-psc" = {
07:41:33.545 STDOUT terraform1.13.3:     "create_time" = "2026-01-30T07:41:20.986621809Z"
07:41:33.546 STDOUT terraform1.13.3:     "description" = ""
07:41:33.546 STDOUT terraform1.13.3:     "effective_labels" = tomap({
07:41:33.546 STDOUT terraform1.13.3:       "goog-terraform-provisioned" = "true"
07:41:33.546 STDOUT terraform1.13.3:     })
07:41:33.546 STDOUT terraform1.13.3:     "etag" = "neqNNeqLVbjNFCmEtbbnkPwNnPNCcGR5i5nJazUwuiY"
07:41:33.546 STDOUT terraform1.13.3:     "id" = "projects/iac-01/locations/australia-southeast2/serviceConnectionPolicies/valkey-psc"
07:41:33.547 STDOUT terraform1.13.3:     "infrastructure" = "PSC"
07:41:33.547 STDOUT terraform1.13.3:     "labels" = tomap(null) /* of string */
07:41:33.547 STDOUT terraform1.13.3:     "location" = "australia-southeast2"
07:41:33.547 STDOUT terraform1.13.3:     "name" = "valkey-psc"
07:41:33.547 STDOUT terraform1.13.3:     "network" = "projects/iac-01/global/networks/stg-iac-01"
07:41:33.547 STDOUT terraform1.13.3:     "project" = "iac-01"
07:41:33.547 STDOUT terraform1.13.3:     "psc_config" = tolist([
07:41:33.548 STDOUT terraform1.13.3:       {
07:41:33.548 STDOUT terraform1.13.3:         "allowed_google_producers_resource_hierarchy_level" = tolist(null) /* of string */
07:41:33.548 STDOUT terraform1.13.3:         "limit" = ""
07:41:33.548 STDOUT terraform1.13.3:         "producer_instance_location" = ""
07:41:33.548 STDOUT terraform1.13.3:         "subnetworks" = tolist([
07:41:33.548 STDOUT terraform1.13.3:           "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
07:41:33.548 STDOUT terraform1.13.3:         ])
07:41:33.548 STDOUT terraform1.13.3:       },
07:41:33.549 STDOUT terraform1.13.3:     ])
07:41:33.549 STDOUT terraform1.13.3:     "psc_connections" = tolist([])
07:41:33.549 STDOUT terraform1.13.3:     "service_class" = "gcp-memorystore"
07:41:33.549 STDOUT terraform1.13.3:     "terraform_labels" = tomap({
07:41:33.549 STDOUT terraform1.13.3:       "goog-terraform-provisioned" = "true"
07:41:33.549 STDOUT terraform1.13.3:     })
07:41:33.549 STDOUT terraform1.13.3:     "timeouts" = null /* object */
07:41:33.549 STDOUT terraform1.13.3:     "update_time" = "2026-01-30T07:41:28.156968484Z"
07:41:33.550 STDOUT terraform1.13.3:   }
07:41:33.550 STDOUT terraform1.13.3: }
07:41:33.550 STDOUT terraform1.13.3: policy_ids = {
07:41:33.550 STDOUT terraform1.13.3:   "valkey-psc" = "projects/iac-01/locations/australia-southeast2/serviceConnectionPolicies/valkey-psc"
07:41:33.550 STDOUT terraform1.13.3: }
```

</details>

---
### 4. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru...

07:41:34.565 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:41:37.679 INFO   Downloading Terraform configurations from ../../../../../../../../modules/memorystore-valkey into ./.terragrunt-cache/qVewf47WF5VoBXN06vvL70xjYjQ/CjHx4mJt3wKzlkpTZFfvE1VlMV8
07:41:37.734 INFO   terraform1.13.3: Initializing the backend...
07:41:38.475 INFO   terraform1.13.3: 
07:41:38.475 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:41:38.476 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:41:38.753 INFO   terraform1.13.3: Initializing modules...
07:41:38.932 INFO   terraform1.13.3: Downloading registry.terraform.io/terraform-google-modules/memorystore/google 16.0.0 for valkey...
07:41:40.331 INFO   terraform1.13.3: - valkey in .terraform/modules/valkey/modules/valkey
07:41:40.377 INFO   terraform1.13.3: Downloading registry.terraform.io/terraform-google-modules/project-factory/google 18.2.0 for valkey.enable_apis...
07:41:42.230 INFO   terraform1.13.3: - valkey.enable_apis in .terraform/modules/valkey.enable_apis/modules/project_services
07:41:42.231 INFO   terraform1.13.3: Initializing provider plugins...
07:41:42.231 INFO   terraform1.13.3: - Finding hashicorp/google-beta versions matching ">= 3.43.0, < 8.0.0"...
07:41:42.348 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 3.43.0, >= 6.0.0, >= 7.13.0, < 8.0.0"...
07:41:42.456 INFO   terraform1.13.3: - Using hashicorp/google-beta v7.17.0 from the shared cache directory
07:41:42.805 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:41:43.129 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:41:43.129 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:41:43.130 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:41:43.130 INFO   terraform1.13.3: you run "terraform init" in the future.
07:41:43.130 INFO   terraform1.13.3: ╷
07:41:43.130 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:41:43.130 INFO   terraform1.13.3: │ 
07:41:43.130 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:41:43.130 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:41:43.131 INFO   terraform1.13.3: │   - hashicorp/google
07:41:43.131 INFO   terraform1.13.3: │   - hashicorp/google-beta
07:41:43.131 INFO   terraform1.13.3: │ 
07:41:43.131 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:41:43.131 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:41:43.131 INFO   terraform1.13.3: │ these providers.
07:41:43.131 INFO   terraform1.13.3: │ 
07:41:43.131 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:41:43.131 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:41:43.132 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:41:43.132 INFO   terraform1.13.3: ╵
07:41:43.132 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:41:47.089 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:41:47.089 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:41:47.090 STDOUT terraform1.13.3:   + create
07:41:47.090 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:41:47.090 STDOUT terraform1.13.3:   # module.valkey.google_memorystore_instance.valkey_cluster will be created
07:41:47.090 STDOUT terraform1.13.3:   + resource "google_memorystore_instance" "valkey_cluster" {
07:41:47.090 STDOUT terraform1.13.3:       + authorization_mode             = "IAM_AUTH"
07:41:47.090 STDOUT terraform1.13.3:       + available_maintenance_versions = (known after apply)
07:41:47.090 STDOUT terraform1.13.3:       + backup_collection              = (known after apply)
07:41:47.090 STDOUT terraform1.13.3:       + create_time                    = (known after apply)
07:41:47.090 STDOUT terraform1.13.3:       + deletion_protection_enabled    = false
07:41:47.090 STDOUT terraform1.13.3:       + discovery_endpoints            = (known after apply)
07:41:47.090 STDOUT terraform1.13.3:       + effective_labels               = {
07:41:47.091 STDOUT terraform1.13.3:           + "component"                  = "memorystore"
07:41:47.091 STDOUT terraform1.13.3:           + "environment"                = "stg"
07:41:47.091 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:41:47.091 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
07:41:47.091 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
07:41:47.091 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
07:41:47.091 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
07:41:47.091 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
07:41:47.092 STDOUT terraform1.13.3:         }
07:41:47.092 STDOUT terraform1.13.3:       + effective_maintenance_version  = (known after apply)
07:41:47.092 STDOUT terraform1
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.